src/InformationRegisters/Расширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Расширения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Назначено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Установлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяСейчас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расширения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РолиКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>РолиКомпьютеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Назначена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Установлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяСейчас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКомпьютеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Расширения/Ext/ManagerModule.bsl
Функция НазначитьРоль(Знач Компьютер, Знач Роль) Экспорт
	
	Запись = СоздатьЗапись(Компьютер, Роль);
	Запись.Назначена = Истина;
	ЗакрытьЗапись(Запись);
	
КонецФункции

Функция СнятьРоль(Знач Компьютер, Знач Роль) Экспорт
	
	Запись = СоздатьЗапись(Компьютер, Роль);
	Запись.Назначена = Истина;
	ЗакрытьЗапись(Запись);
	
КонецФункции

Функция ЗапуститьУстановкуРоли(Знач Компьютер, Знач Роль) Экспорт
	
	Ключ = ФоновоеВыполнение.КлючЗадания(Компьютер, Роль, "Установка");
	Если ФоновоеВыполнение.НайтиАктивноеЗаданиеПоКлючу(Ключ) = Неопределено Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Компьютер);
		ПараметрыЗадания.Добавить(Роль);
		ФоновыеЗадания.Выполнить("ФоновоеВыполнение.УстановитьРоль", ПараметрыЗадания, Ключ, Ключ);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьРоль(Знач Компьютер, Знач Роль) Экспорт
	
	Запись = СоздатьЗапись(Компьютер, Роль, "Установка");
	
	Результат = ПолучитьМенеджерРоли(Роль);
	Если НЕ Результат.КодВозврата = 0 Тогда
		ЗакрытьЗапись(Запись, Ложь, Истина, Результат.ОписаниеОшибки, Результат.Лог);
		Возврат Результат;
	КонецЕсли;
	МенеджерРоли = Результат.МенеджерРоли;
	
	Результат = ПроверитьРоль(Компьютер, Роль, Ложь);
	Если Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗакрытьЗапись(Запись, Истина, Ложь, "", "");
	Результат = МенеджерРоли.УстановитьРоль(Компьютер);
	Если НЕ Результат.КодВозврата = 0 Тогда
		ЗакрытьЗапись(Запись, Ложь, Истина, Результат.ОписаниеОшибки, Результат.Лог);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПроверитьРоль(Компьютер, Роль, Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция УдалитьРоль(Знач Компьютер, Знач Роль) Экспорт
	
	Запись = СоздатьЗапись(Компьютер, Роль, "Удаление");
	
	Результат = ПолучитьМенеджерРоли(Роль);
	Если НЕ Результат.КодВозврата = 0 Тогда
		ЗакрытьЗапись(Запись, Ложь, Истина, Результат.ОписаниеОшибки, Результат.Лог);
		Возврат Результат;
	КонецЕсли;
	МенеджерРоли = Результат.МенеджерРоли;
	
	Результат = ПроверитьРоль(Компьютер, Роль, Ложь);
	Если Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = МенеджерРоли.УстановитьРоль(Компьютер);
	Если Результат.КодВозврата = 0 Тогда
		ЗакрытьЗапись(Запись, Ложь, Истина, Результат.ОписаниеОшибки, Результат.Лог);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПроверитьРоль(Компьютер, Роль, Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьРоль(Знач Компьютер, Знач Роль, ИспользоватьКэш = Истина) Экспорт

	Если ИспользоватьКэш Тогда
		Возврат РегистрыСведений.РолиКомпьютеров.СостояниеРоли(Компьютер, Роль);
	КонецЕсли;
	
	Запись = СоздатьЗапись(Компьютер, Роль, "Проверка");
	Результат = ПолучитьМенеджерРоли(Роль);
	Если НЕ Результат.КодВозврата = 0 Тогда
		ЗакрытьЗапись(Запись, Ложь, Истина, Результат.ОписаниеОшибки, Результат.Лог);
		Возврат Результат;
	КонецЕсли;
	МенеджерРоли = Результат.МенеджерРоли;
	
	Результат = МенеджерРоли.ПроверитьРоль(Компьютер);
	ЗакрытьЗапись(Запись, Ложь, НЕ Результат.КодВозврата = 0, Результат.ОписаниеОшибки, Результат.Лог);
	
	Возврат Результат;
	
КонецФункции


Функция СоздатьЗапись(Компьютер, Знач Роль, ВыполняемаяОперация = Неопределено) 

	Роль = Роль(Роль);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Компьютер = Компьютер;
	Запись.Роль = Роль;
	Запись.Прочитать();
	Если НЕ Запись.Выбран() Тогда
		Запись.Активность = Истина;
		Запись.Компьютер = Компьютер;
		Запись.Роль = Роль;
	КонецЕсли;
	
	Если НЕ ВыполняемаяОперация = Неопределено Тогда
		Запись.ВыполняемаяОперация = ВыполняемаяОперация;
	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

Функция ЗакрытьЗапись(Запись, ВыполняетсяСейчас = Неопределено, ЕстьОшибки = Неопределено, ОписаниеОшибки = Неопределено, Лог = Неопределено)

	Запись.ДатаОбновления = ТекущаяДата();
	Если НЕ ВыполняетсяСейчас = Неопределено Тогда
		Запись.ВыполняетсяСейчас = ВыполняетсяСейчас;
	КонецЕсли;
	Если НЕ ЕстьОшибки = Неопределено Тогда
		Запись.ЕстьОшибки = ЕстьОшибки;
	КонецЕсли;
	Если НЕ ОписаниеОшибки = Неопределено Тогда
		Запись.ОписаниеОшибки = ОписаниеОшибки;
	КонецЕсли;
	Если НЕ Лог = Неопределено Тогда
		Запись.Лог = Лог;
	КонецЕсли;
	Запись.Записать();

КонецФункции // ()

Функция СостояниеРоли(Компьютер, Знач Роль) Экспорт

	Роль = Роль(Роль);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Компьютер.Установить(Компьютер, Истина);
	Набор.Отбор.Роль.Установить(Роль, Истина);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	
	Результат = Новый Структура("Назначена, Установлена, ЕстьОшибки, ВыполняемаяОперация, ВыполняетсяСейчас, ДатаОбновления, ОписаниеОшибки, Лог");
	ЗаполнитьЗначенияСвойств(Результат, Запись);
	
	Возврат Результат;

КонецФункции



Функция ОбновитьДляКомпьютера(Знач Компьютер) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Компьютер.Установить(Компьютер, Истина);
	Набор.Прочитать();
	тз = Набор.Выгрузить();
	ВсеРоли = ВсеРоли();
	Для каждого Роль Из ВсеРоли Цикл
		Если тз.Найти(Роль, "Роль") = Неопределено Тогда
			Запись = Набор.Добавить();
			Запись.Активность = Истина;
			Запись.Компьютер = Компьютер;
			Запись.Роль = Роль;
			Запись.Назначена = Ложь;
			Запись.Установлена = Ложь;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();

КонецФункции // ()

Функция ОбновитьДляРоли(Знач Роль) Экспорт
	
	Роль = Роль(Роль);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Роль.Установить(Роль, Истина);
	Набор.Прочитать();
	тз = Набор.Выгрузить();
	ВсеКомпьютеры = ВсеКомпьютеры();
	Для каждого Компьютер Из ВсеКомпьютеры Цикл
		Если тз.Найти(Компьютер, "Компьютер") = Неопределено Тогда
			Запись = Набор.Добавить();
			Запись.Активность = Истина;
			Запись.Компьютер = Компьютер;
			Запись.Роль = Роль;
			Запись.Назначена = Ложь;
			Запись.Установлена = Ложь;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();

КонецФункции



Функция ВсеРоли() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РолиКомпьютеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.РолиКомпьютеров КАК РолиКомпьютеров";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ВсеКомпьютеры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Компьютеры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Компьютеры КАК Компьютеры";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция Роль(Роль) Экспорт

	Если Роль = Неопределено Тогда
		Возврат Справочники.РолиКомпьютеров.ПустаяСсылка();
	ИначеЕсли ТипЗнч(Роль) = Тип("Строка") Тогда
		Если ПустаяСтрока(Роль) Тогда
			Возврат Справочники.РолиКомпьютеров.ПустаяСсылка();
		Иначе
			Возврат Справочники.РолиКомпьютеров.НайтиПоНаименованию(Роль);
		КонецЕсли;
	ИначеЕсли НЕ ТипЗнч(Роль) = Тип("СправочникСсылка.РолиКомпьютеров") ИЛИ Роль.Пустая() Тогда
		ВызватьИсключение "Не удалось найти роль: " + Роль;
	КонецЕсли;
	
	Возврат Роль;
	
КонецФункции // ()


Функция ФайлСуществует(ИмяФайла)

	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();

КонецФункции // ()

Функция ПолучитьМенеджерРоли(Знач Роль) Экспорт

	Роль = Роль(Роль);
	
	КаталогМенеджеров = "G:\1c\epf\onesible\role-managers";
	ИмяФайлаМенеджера = СтрШаблон("%1\RoleManager%2.epf", КаталогМенеджеров, Роль.Наименование);
	
	Если НЕ ФайловаяСистема.ФайлСуществует(ИмяФайлаМенеджера) Тогда
		ОписаниеОшибки = "Не найден менеджер для роли (файл """ + ИмяФайлаМенеджера + """ не существует)";
		Возврат Результат(1, ОписаниеОшибки);
	КонецЕсли;
	
	МенеджерРоли = ВнешниеОбработки.Создать(ИмяФайлаМенеджера, Ложь);
	
	Результат = Результат(0);
	Результат.Вставить("МенеджерРоли", МенеджерРоли);
	
	Возврат Результат;

КонецФункции // ()
